/* 7.1 Напишите запрос, возвращающий с 17 го по 25 й символы строки 'Please find the substring in this string' (Пожалуйста, найдите подстроку в этой строке).	*/

SELECT SUBSTRING('Please find the substring in this string', 17, 25-17);
/*RESULT
+------------------------------------------------------------------+
| SUBSTRING('Please find the substring in this string', 17, 25-17) |
+------------------------------------------------------------------+
| substrin                                                         |
+------------------------------------------------------------------+
*/

/* 7.2 Напишите запрос, возвращающий абсолютную величину и знак ( 1, 0 или 1) числа –25,768 23. Также возвратите число, округленное до сотых.	*/

SELECT ABS(-25.76823) ABS, SIGN(-25.76823) SIGN, ROUND(-25.76823, 2) ROUND;
/*RESULT
+----------+------+--------+
| ABS      | SIGN | ROUND  |
+----------+------+--------+
| 25.76823 |   -1 | -25.77 |
+----------+------+--------+
*/

/* 7.3 Напишите запрос, возвращающий только значение месяца текущей даты.*/

SELECT EXTRACT(MONTH FROM CURRENT_DATE()) MONTH, CURRENT_DATE();
/*RESULT
+-------+----------------+
| MONTH | CURRENT_DATE() |
+-------+----------------+
|     2 | 2023-02-06     |
+-------+----------------+
*/


